app/controllers/questions_controller.rb

INSERT INTO "questions" ("text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["text", "Как дела?"], ["created_at", "2021-11-22 06:07:26.614181"], ["updated_at", "2021-11-22 06:07:26.614181"], ["user_id", 1]]
---
  def create
    @question = Question.new(question_params)
    @question.author = current_user

    if @question.save

UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["answer", "На месте"], ["updated_at", "2021-11-23 13:50:13.988274"], ["id", 5]]
---
  def update
    if @question.update(question_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def load_question
    @question = Question.find(params[:id])