app/models/user.rb

  def self.authenticate(email, password)
    # Сперва находим кандидата по email, с учётом, что имэйл хранится в базе в
    # нижнем регистре
    user = find_by(email: email&.downcase)

    return unless user.present?

    # Формируем хэш пароля из того, что передали в метод
    hashed_password = User.hash_to_string(
      OpenSSL::PKCS5.pbkdf2_hmac(
        password, user.password_salt, ITERATIONS, DIGEST.length, DIGEST
      )
    )
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Edik"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "anton4"], ["LIMIT", 1]]